Autodesk.Revit.DB.ImageTypeSource
The source of the data used to generate the image.
Since:
2021
Since:
2021

Autodesk.Revit.DB.ImageTypeSource.Internal
The image data was created internally.
These are rendering images or views saved in the project as images.

Autodesk.Revit.DB.ImageTypeSource.Import
The image data was imported into the Revit document.

Autodesk.Revit.DB.ImageTypeSource.Link
The image data is from an externally linked image file.